{
  "col1": {
    "title": "Education",
    "items": [
      {
        "title": "Community University of<br>San Luis Potosí",
        "subtitle": "Student",
        "date": "Aug 2008 - Jun 2012",
        "text": "Bachelor's Degree in Computer Science"
      },
      {
        "title": "Ironhack",
        "subtitle": "Student",
        "date": "Aug 2013 - Nov 2013",
        "text": "Learned modern full-stack development using JavaScript, React, Node.js, Express, and MongoDB. Built and deployed full-stack apps using Agile practices."
      }
    ]
  },
  "col2": {
    "title": "Work History",
    "items": [
      {
        "title": "Upwork",
        "subtitle": "Senior Freelance Software Engineer",
        "date": "Apr 2022 - ",
        "text": "Successfully delivered high-impact web and mobile applications for global clients, specializing in React, Next.js, React Native, Node.js, NestJS, AWS, Python, and AI/ML solutions.",
        "button": {
          "type": "modal",
          "link": "#recommentation1",
          "label": "Recommendation"
        }
      },
      {
        "title": "IntelliCode",
        "subtitle": "Senior Full Stack Developer",
        "date": "Oct 2024 - Apr 2025",
        "text": "Led full-stack development at IntelliCode, building scalable web applications and APIs using React, Next.js, Python, Django, FastAPI, and AWS to deliver robust software solutions for diverse client needs.",
        "button": {
          "type": "modal",
          "link": "#recommentation3",
          "label": "Recommendation"
        }
      },
      {
        "title": "iTexico",
        "subtitle": "Full Stack Developer",
        "date": "Nov 2018 - Feb 2022",
        "text": "Developed and scaled a modern single-page application while leading key migrations from Backbone to React, building a custom UI framework, and implementing high-performance features using technologies like ElasticSearch, Kafka, AWS, and TypeScript.",
        "button": {
          "type": "modal",
          "link": "#recommentation4",
          "label": "Recommendation"
        }
      },
      {
        "title": "EPAM Systems",
        "subtitle": "Senior Developer",
        "date": "Sep 2016 - Oct 2018",
        "text": "Led the design and implementation of a scalable AWS architecture and internal admin platform, integrating serverless technologies and security automation while developing custom tools, dashboards, and cost-optimized cloud solutions using React, Node.js, and AWS services."
      },
      {
        "title": "Dextra Technologies",
        "subtitle": "Web Developer",
        "date": "Jun 2014 - Aug 2016",
        "text": "Improved system reliability by implementing retry logic and resolving bugs, enhanced API capabilities, and seamlessly migrated service integrations while preserving core functionality using Node.js, AWS, and SQL databases."
      },
      {
        "title": "UST Global",
        "subtitle": "Software Engineer",
        "date": "Nov 2012 - May 2014",
        "text": "Developed RESTful web services with Jersey, Hibernate, and Spring, practiced test-driven development, created and executed test cases, managed the full defect lifecycle, and contributed to frontend updates using JavaScript, HTML, and CSS."
      }
    ]
  }
}
